In [187]:
import pandas as pd
from pandas.api.types import is_string_dtype

In [222]:
import warnings
with warnings.catch_warnings():
    warnings.simplefilter("ignore")

In [231]:
filename = 'dataset1.csv'

In [232]:
data = pd.read_csv("raw_data/{}".format(filename))
data.head(10)
data.shape

(5000, 2)

In [233]:
data

                name       price
0      William Dixon  109.037280
1       Kristen Horn  262.524652
2     Kimberly Chang  187.007258
3          Mary Ball  283.174648
4     Benjamin Craig  143.871582
...              ...         ...
4995  Shirley Nguyen    9.011665
4996     Jesse Brown  247.328232
4997   Valerie Owens  238.103714
4998    Alicia Sharp  243.622929
4999   Sherry Jensen   13.839516

[5000 rows x 2 columns]

In [234]:
def drop_nan_names(data):
    return data[data['name'].notna()]

def split_names(data):
    data[['first_name', 'last_name']] = data['name'].str.split(' ', 1, expand=True)
    data.drop('name', axis=1, inplace=True)
    return data

def remove_prepended_zeroes(data):
    if not is_string_dtype(data['price']):
        data['price'].map(str)
    data['price'] =  [str(p).lstrip("0") for p in data['price']]
    return data

def add_above_100(data):
    data['above_100'] = [True if float(p) > 100 else False for p in data['price']]
    return data

In [235]:
def data_pipeline():
    data = drop_nan_names(data)
    data = split_names(data)
    data = remove_prepended_zeroes(data)
    data = add_above_100(data)

In [236]:
data = data.pipe(drop_nan_names).pipe(split_names).pipe(remove_prepended_zeroes).pipe(add_above_100)

In [237]:
data

            price first_name last_name  above_100
0     109.0372796    William     Dixon       True
1     262.5246522    Kristen      Horn       True
2     187.0072583   Kimberly     Chang       True
3     283.1746476       Mary      Ball       True
4     143.8715817   Benjamin     Craig       True
...           ...        ...       ...        ...
4995  9.011665323    Shirley    Nguyen      False
4996  247.3282318      Jesse     Brown       True
4997  238.1037141    Valerie     Owens       True
4998   243.622929     Alicia     Sharp       True
4999  13.83951571     Sherry    Jensen      False

[5000 rows x 4 columns]

In [230]:
# data[data['price'].str.startswith('0', na=False)]